-- MySQL dump 10.13  Distrib 8.3.0, for macos14.2 (arm64)
--
-- Host: 127.0.0.1    Database: shdb
-- ------------------------------------------------------
-- Server version	8.0.34

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Dept`
--

DROP TABLE IF EXISTS `Dept`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Dept` (
  `id` tinyint unsigned NOT NULL AUTO_INCREMENT,
  `pid` tinyint unsigned NOT NULL DEFAULT '0' COMMENT '상위부서id',
  `dname` varchar(31) COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Dept`
--

LOCK TABLES `Dept` WRITE;
/*!40000 ALTER TABLE `Dept` DISABLE KEYS */;
INSERT INTO `Dept` VALUES (1,0,'영업부'),(2,0,'개발부'),(3,1,'영업1팀'),(4,1,'영업2팀'),(5,1,'영업3팀'),(6,2,'서버팀'),(7,2,'클라이언트팀');
/*!40000 ALTER TABLE `Dept` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Emp`
--

DROP TABLE IF EXISTS `Emp`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Emp` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `ename` varchar(31) COLLATE utf8mb4_unicode_ci NOT NULL,
  `dept` tinyint unsigned NOT NULL,
  `salary` int NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `dept` (`dept`),
  CONSTRAINT `emp_ibfk_1` FOREIGN KEY (`dept`) REFERENCES `Dept` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=253 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Emp`
--

LOCK TABLES `Emp` WRITE;
/*!40000 ALTER TABLE `Emp` DISABLE KEYS */;
INSERT INTO `Emp` VALUES (2,'유세혜',4,300),(3,'원사아',4,100),(4,'김태혜',5,700),(5,'지세국',7,400),(6,'최가국',4,800),(7,'배파나',1,800),(8,'원성결',2,200),(9,'전바찬',6,900),(10,'지윤희',5,500),(11,'전차가',1,900),(12,'지호하',3,800),(13,'최종라',5,300),(14,'마마순',1,700),(15,'원자파',7,200),(16,'이결세',7,700),(17,'원호신',2,600),(18,'전국찬',3,900),(19,'방성찬',3,800),(20,'최희결',5,700),(21,'지찬파',2,600),(22,'최파지',4,100),(23,'마다윤',4,300),(24,'이윤파',6,600),(25,'전다윤',3,800),(26,'김나나',1,800),(27,'원호순',7,600),(28,'조국국',7,400),(29,'이윤바',1,300),(30,'김바순',2,800),(31,'방윤윤',6,600),(32,'방호지',4,900),(33,'최마호',1,500),(34,'전아가',3,600),(35,'원성태',6,600),(36,'마다라',3,900),(37,'지라파',3,200),(38,'김자나',3,300),(39,'전가순',2,400),(40,'유호가',6,400),(41,'방사자',6,400),(42,'마윤결',2,700),(43,'마마차',1,800),(44,'이찬가',4,100),(45,'유태파',5,500),(46,'유호다',4,200),(47,'이신희',6,900),(48,'천마라',7,200),(49,'이순아',4,600),(50,'최찬자',7,200),(51,'김바가',4,500),(52,'원가국',6,600),(53,'방가다',7,100),(54,'전순차',6,700),(55,'조종차',5,600),(56,'전호라',3,200),(57,'천호윤',4,500),(58,'마신혜',1,300),(59,'전세국',2,600),(60,'지호태',2,300),(61,'유혜태',4,700),(62,'천세찬',4,800),(63,'지바혜',3,200),(64,'천가차',1,800),(65,'배세사',2,800),(66,'방나하',6,200),(67,'최호태',1,800),(68,'마가혜',3,100),(69,'김성바',6,200),(70,'방혜국',5,600),(71,'이파파',4,300),(72,'지윤혜',7,100),(73,'박찬종',6,600),(74,'방혜윤',3,300),(75,'전호바',1,600),(76,'유희마',1,700),(77,'천성혜',7,500),(78,'김나라',3,800),(79,'최혜성',1,700),(80,'지종라',4,900),(81,'이바희',7,800),(82,'최은가',4,800),(83,'배자호',5,500),(84,'배사파',7,500),(85,'마성다',2,400),(86,'최국세',3,600),(87,'유다지',4,600),(88,'천결신',4,400),(89,'박태사',7,300),(90,'원파가',7,900),(91,'마순차',7,300),(92,'지호희',6,700),(93,'최가국',6,800),(94,'마성나',1,200),(95,'조하마',4,700),(96,'원바가',3,300),(97,'최신세',2,900),(98,'김은다',5,900),(99,'천라국',5,500),(100,'원신국',1,200),(101,'방국윤',5,300),(102,'박세찬',4,600),(103,'최종다',4,500),(104,'이신찬',4,900),(105,'원종마',6,900),(106,'최신호',6,200),(107,'지차찬',3,100),(108,'이나종',1,100),(109,'김결나',6,500),(110,'조파호',3,600),(111,'유신찬',5,200),(112,'원세태',1,200),(113,'방호혜',5,800),(114,'유마자',7,200),(115,'최순신',2,900),(116,'조윤혜',7,100),(117,'조호호',3,400),(118,'마세사',3,900),(119,'방결희',1,600),(120,'지국혜',1,300),(121,'박세결',3,100),(122,'조지혜',4,800),(123,'방은희',7,800),(124,'이성가',7,900),(125,'원지신',5,300),(126,'천윤아',3,600),(127,'원순지',1,400),(128,'이윤바',7,900),(129,'김신호',6,300),(130,'원혜호',2,600),(131,'천윤사',2,800),(132,'천희가',3,600),(133,'원결바',5,900),(134,'마성호',4,100),(135,'이성다',3,800),(136,'조사자',5,800),(137,'천찬혜',3,400),(138,'전지사',6,900),(139,'방자세',2,800),(140,'지아마',7,700),(141,'김찬마',2,500),(142,'방가사',7,500),(143,'배아순',7,400),(144,'최호희',6,200),(145,'최혜혜',4,400),(146,'유태차',3,200),(147,'원국은',1,700),(148,'조혜은',7,400),(149,'조가마',2,200),(150,'김찬라',7,300),(151,'최신세',2,900),(152,'박성종',1,900),(153,'지나국',6,600),(154,'마파결',1,500),(155,'조태국',5,200),(156,'방나차',3,600),(157,'김지희',3,500),(158,'유나순',5,100),(159,'조윤호',6,100),(160,'배다결',7,200),(161,'배희호',1,500),(162,'방호성',4,400),(163,'김세은',3,900),(164,'최성라',4,800),(165,'마신신',1,200),(166,'유윤사',2,800),(167,'전파자',3,200),(168,'박국다',3,300),(169,'김다바',5,200),(170,'원호신',6,700),(171,'김호파',5,500),(172,'방나자',2,900),(173,'박세자',4,300),(174,'원결바',4,500),(175,'김태신',5,300),(176,'최신신',2,700),(177,'배가하',5,300),(178,'지나다',2,200),(179,'박사파',7,500),(180,'천신아',4,300),(181,'이가세',1,900),(182,'방신다',4,100),(183,'방태가',6,700),(184,'박하아',7,500),(185,'천성가',7,700),(186,'이호라',3,400),(187,'천다종',1,600),(188,'이하결',7,700),(189,'이은호',7,400),(190,'이성다',3,800),(191,'이신신',1,200),(192,'마세가',2,100),(193,'원세순',7,700),(194,'원윤가',1,600),(195,'김세윤',6,900),(196,'최찬라',1,600),(197,'유호윤',7,400),(198,'박차호',5,700),(199,'마바순',2,800),(200,'방국가',1,200),(201,'최세마',1,300),(202,'조라종',6,500),(203,'이지마',4,700),(204,'김신호',6,300),(205,'김은다',6,200),(206,'마세혜',7,700),(207,'김하세',1,200),(208,'원순세',5,400),(209,'원마종',6,600),(210,'마사혜',2,200),(211,'박나신',5,300),(212,'전호사',6,100),(213,'지지호',2,400),(214,'천혜파',2,900),(215,'지사세',6,700),(216,'방나태',6,100),(217,'김지하',6,400),(218,'지찬태',3,300),(219,'조사나',4,800),(220,'지차순',6,800),(221,'지희태',3,300),(222,'이희나',5,800),(223,'배신마',7,900),(224,'배나희',3,900),(225,'마아세',4,800),(226,'전바신',2,900),(227,'박희윤',1,200),(228,'천결호',1,100),(229,'마사혜',2,200),(230,'최종바',6,300),(231,'원파가',1,200),(232,'지희결',5,200),(233,'김자마',6,200),(234,'방성세',1,900),(235,'마바성',6,600),(236,'천마마',2,200),(237,'최가세',6,100),(238,'김파희',3,200),(239,'마찬아',5,900),(240,'김세가',1,200),(241,'전차나',2,700),(242,'유희국',2,100),(243,'전희마',1,800),(244,'마호차',3,200),(245,'배태바',5,600),(246,'배나희',4,300),(247,'유은종',6,300),(248,'원세마',6,300),(249,'배마가',4,100),(250,'유결호',1,700),(251,'지태윤',4,100),(252,'배호가',7,600);
/*!40000 ALTER TABLE `Emp` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'shdb'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-19  0:19:39
